{"modelTopology": {"model_config": {"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"name": "input_1", "batch_input_shape": [null, 63], "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "activation": "relu", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 100, "bias_regularizer": null, "name": "dense_1", "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}}}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"trainable": true, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_2", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "activation": "relu", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 100, "bias_regularizer": null, "name": "dense_2", "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}}}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"trainable": true, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "beta_regularizer": null, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "axis": -1, "name": "batch_normalization_2", "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]], "class_name": "Add", "name": "add_1", "config": {"trainable": true, "name": "add_1"}}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_3", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "activation": "linear", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 1, "bias_regularizer": null, "name": "dense_3", "kernel_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}}}], "output_layers": [["dense_3", 0, 0]], "name": "model_1"}}, "backend": "tensorflow", "training_config": {"optimizer_config": {"class_name": "RMSprop", "config": {"epsilon": 1e-07, "lr": 0.0010000000474974513, "decay": 0.0, "rho": 0.8999999761581421}}, "sample_weight_mode": null, "loss_weights": null, "loss": "mse", "metrics": ["mse", "rmse"]}, "keras_version": "2.2.2"}, "weightsManifest": [{"weights": [{"shape": [100], "dtype": "float32", "name": "batch_normalization_1/gamma"}, {"shape": [100], "dtype": "float32", "name": "batch_normalization_1/beta"}, {"shape": [100], "dtype": "float32", "name": "batch_normalization_1/moving_mean"}, {"shape": [100], "dtype": "float32", "name": "batch_normalization_1/moving_variance"}, {"shape": [100], "dtype": "float32", "name": "batch_normalization_2/gamma"}, {"shape": [100], "dtype": "float32", "name": "batch_normalization_2/beta"}, {"shape": [100], "dtype": "float32", "name": "batch_normalization_2/moving_mean"}, {"shape": [100], "dtype": "float32", "name": "batch_normalization_2/moving_variance"}, {"shape": [63, 100], "dtype": "float32", "name": "dense_1/kernel"}, {"shape": [100], "dtype": "float32", "name": "dense_1/bias"}, {"shape": [100, 100], "dtype": "float32", "name": "dense_2/kernel"}, {"shape": [100], "dtype": "float32", "name": "dense_2/bias"}, {"shape": [100, 1], "dtype": "float32", "name": "dense_3/kernel"}, {"shape": [1], "dtype": "float32", "name": "dense_3/bias"}], "paths": ["group1-shard1of1"]}]}